{
    "version": "https://jsonfeed.org/version/1",
    "title": "<svg class=\"fi fi-power\" width=\"24px\" height=\"24px\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" viewBox=\"0 0 24 24\"><use href=\"https://ledifese101.github.io/the_chronicles/media/plugins/featherIcons/feather-sprite.svg#power\" /></svg>",
    "description": "",
    "home_page_url": "https://ledifese101.github.io/the_chronicles",
    "feed_url": "https://ledifese101.github.io/the_chronicles/feed.json",
    "user_comment": "",
    "author": {
        "name": "difese101"
    },
    "items": [
        {
            "id": "https://ledifese101.github.io/the_chronicles/my-favourite-slasher.html",
            "url": "https://ledifese101.github.io/the_chronicles/my-favourite-slasher.html",
            "title": "My favourite Slasher.",
            "summary": "Let us start off with something borderline unhinged. We have all seen our fair share of slasher / thriller films, such as \"Saw\", \"Scream\", \"Nightmare on Elm Street\", \"Halloween\", so on and so forth. Out of&hellip;",
            "content_html": "<p>Let us start off with something borderline unhinged.</p>\n<p>We have all seen our fair share of slasher / thriller films, such as \"Saw\", \"Scream\", \"Nightmare on Elm Street\", \"Halloween\", so on and so forth. Out of all of them, I would have to say Michael Myers (Halloween) is my favourite. But, really, the love for Michael Myers cemented when I was playing <em>Dead by Daylight</em> back in the day.</p>\n<p>Stealth, stalk, slit - that is his killing philosophy. Simple, easy and contemporary, it gets the job done. The other killers play with their victims too much, in my opinion. In some ways, it kind of disrupts the aura and mystique around those characters.</p>\n<p>Chucky: screws around too much, even though he is hard to catch and skittish (which I understand, is part of his character). This little rat somewhat gave me a somewhat traumatic lasting impression during childhood, though it is non-existent now.</p>\n<p>Freddy Krueger: can't really remember much as it was plenty of years ago I watched. But I know, if one dies in the dream, he dies in real life too.</p>\n<p>Jigsaw: I do not think I can survive in any of Jigsaw's games 😅</p>\n<p>Jason Voorhees: never really watched Friday the 13th series. I cannot comment.</p>\n<p>Ghostface: while his stealth is on-point, I can understand his thing for psychological warfare by calling his victims before killing them. Still, not my thing.</p>\n<p>Which is why Michael Myers is my favourite. I would like to think I have a fighting chance against him, even though the odds are against me. I can run, but I would also expect him to walk faster than I run, or appear somewhere bamboozling me xD</p>\n<p>I have watched the original 1978 film, Halloween II, and the recent reboot from 2018 to 2022. I did not really bother watching those in between, as I feel like, from the little snippets that I have watched on Youtube, it did not really bring justice to his character. Michael Myers is literally the Evil Incarnate, with an ungodly tolerance to pain. The original first two, and the recent reboot did really bring out something: the <em>fear</em>, the thriller \"<em>oomph!</em>\" that really brings you into the movie, and, to some extend, feeling what Michael's victims are experiencing.</p>\n<p>Watching the recent and modern reboot has me rooting for both Laurie Strode and Michael Myers. Watching \"Halloween Ends\" was kind of a bittersweet moment. As much as I did not want this awesome franchise to end, I would still have to let go, as everything has to come an end. However, the legend behind the story of Michael Myers (and Laurie Strode, of course), will forever live. Also, the seemingly infinite amount of jumpscares when playing against Michael Myers in <em>Dead by Daylight</em>.</p>\n<p>Could I also do a shoutout to the music composer behind those Halloween films I've watched - John Carpenter. As I understand, his son worked with him on the 2018 to 2022 films. How one simple melody, played with the right tempo and instrument, can be so menacing and thrilling. Just when you think they cannot outdo the original, they somehow managed to pull it off. Case in point: <a href=\"https://www.youtube.com/watch?v=m8H3M0DDWDs\">The Shape Hunts Allyson - John Carpenter</a>, from Halloween 2018.</p>\n<p>Well, there you have it: awesome character(s), with a great aura and mystique around Michael Myers, slapping music to lift up the characters of the movie, and a beautiful thrilling energy to not make you want to look, but still take a peek to find out what happens next to the victims. This is Halloween.</p>\n<p> </p>\n<p>Till the next...<br>Difese</p>",
            "author": {
                "name": "difese101"
            },
            "tags": [
                   "random thoughts",
                   "08/2025"
            ],
            "date_published": "2025-08-11T02:11:53+08:00",
            "date_modified": "2025-08-11T03:22:38+08:00"
        },
        {
            "id": "https://ledifese101.github.io/the_chronicles/pilot.html",
            "url": "https://ledifese101.github.io/the_chronicles/pilot.html",
            "title": "Pilot.",
            "summary": "First (and test) post! This space is still bare, with just the skeleton and certain foundations being built. Nevertheless, I'd still love to thank AlaskanTF and tabsTrainee for being patient, and helping me set up this&hellip;",
            "content_html": "<p>First (and test) post! This space is still bare, with just the skeleton and certain foundations being built. Nevertheless, I'd still love to thank <a href=\"blog.alaskantf.com\" target=\"_blank\" rel=\"noopener noreferrer\">AlaskanTF</a> and tabsTrainee for being patient, and helping me set up this little space.</p>\n<p>Hello! My name is Difese101 (pronounced <em>dee-feh-sey</em>), just a random common human on this rock, made from star-dust floating through space, surviving and experiencing life. This space acts as a diary of sorts, in the case I ever suffer from Alzheimer's or Senile Dementia xD</p>\n<p>I also hope to bring some form of entertainment through the day-to-day shenanigans, some thought-provoking topics, and also to share some random things that could be going through my mind. I shall try to update as and when I can.</p>\n<p> </p>\n<p>Till the next post...<br>Difese</p>",
            "author": {
                "name": "difese101"
            },
            "tags": [
                   "random thoughts",
                   "08/2025"
            ],
            "date_published": "2025-08-08T01:47:36+08:00",
            "date_modified": "2025-08-11T02:13:04+08:00"
        }
    ]
}
