{
    "version": "https://jsonfeed.org/version/1",
    "title": "<svg class=\"fi fi-power\" width=\"24px\" height=\"24px\" fill=\"none\" stroke=\"currentColor\" stroke-width=\"2\" viewBox=\"0 0 24 24\"><use href=\"https://LCStephano.github.io/the_memoirs/media/plugins/featherIcons/feather-sprite.svg#power\" /></svg>",
    "description": "",
    "home_page_url": "https://LCStephano.github.io/the_memoirs",
    "feed_url": "https://LCStephano.github.io/the_memoirs/feed.json",
    "user_comment": "",
    "author": {
        "name": "Stephano"
    },
    "items": [
        {
            "id": "https://LCStephano.github.io/the_memoirs/insurance-2.html",
            "url": "https://LCStephano.github.io/the_memoirs/insurance-2.html",
            "title": "Insurance",
            "summary": "**WARNING** Today's information in this post is strictly my thoughts and comments on today's topic. DO NOT use whatever information here as advice to further your financial portfolio. Please consult a proper Financial Consultant at your&hellip;",
            "content_html": "<h3>**WARNING**</h3>\n<p>Today's information in this post is strictly my thoughts and comments on today's topic. <strong>DO NOT</strong> use whatever information here as advice to further your financial portfolio. Please consult a proper Financial Consultant at your disposal to thoroughly discuss your financial goals.</p>\n<p> </p>\n<h3>Away we go~</h3>\n<p>I <em>was</em> once a Financial Consultant; I no longer hold the license anymore. Still, I am an advocate for Insurance as this is some form of safety net for both you and your family, should anything happen to the breadwinner of the house. I know it works, because I am a very good example of it. Some shit happened to my family, in which I <em>might</em> discuss about it in another post, but the insurance payout helped alot, and it made sure I could stand on my own two-feet for a certain amount of time. Today we shall discuss about the different types of insurance you can find.</p>\n<h3>First, a wake-up call:</h3>\n<p>Correct me if I'm wrong, everyone wishes to die peacefully in their sleep. NEWSFLASH! At least half of the population will not. Somehow or rather, we may unexpectedly die in accidents or injuries. What is worse: we die slowly, suffering from diesases. If not, we may be in the hospital, put under observation for certain reasons.</p>\n<p>The no.1 killer disease in humans is cardiovascular diseases, which includes the heart and lung. Next, is cancer - prostate for the men, and breast for the women. This could be hereditary, or it could be developed within oneself.</p>\n<p>Long story short: all of us will die one day, regardless the cause. The question is: how do we ensure our future generations are taken care of financially?</p>\n<p> </p>\n<h3>The Different Types of Insurance Plans</h3>\n<p>In an ideal portfolio, it is best to have all of the following covered. Even if one cannot afford to cover all at one go, it is good to slowly build up to cover every aspect of your portfolio.</p>\n<p><span style=\"text-decoration: underline;\"><strong>Hospitalization (Intergrated Shield Plans)</strong></span><br>The most basic of all Insurance. Basically, the costs that you have incurred at your stay in your hospital, the Insurance Company will pay a good chunk of it. I do not really know how it works in other countries, but for Singapore, one has to pay the \"Deductible\" and \"Co-Payment\". The \"Co-Payment\" kicks in, <span style=\"text-decoration: underline;\"><strong>after</strong></span> he/she pays the \"Deductible\".</p>\n<p>This should be the very first plan that you purchase, especially after you start working, as you can use your Medisave (CPF) to pay for it.</p>\n<p>For example:<br>Your hospital bill: <span style=\"text-decoration: underline;\">$100,000<br></span>Deductible: <span style=\"text-decoration: underline;\">$3,500<br></span>Balance: <span style=\"text-decoration: underline;\">$96,500</span><br>Co-Payment (10% of Balance): <span style=\"text-decoration: underline;\">$9,650</span><br>You pay: <span style=\"text-decoration: underline;\">$9,650 + $3,500 = $13,150</span><br>Insurance Company pays: <span style=\"text-decoration: underline;\">$86,850</span></p>\n<p>Depending on the Insurance companies, there is a \"Rider\" you can use to tag onto your Hospitalization plan, which could reduce co-payment down to a minimum of 5%, subjected to government regulations.</p>\n<p><span style=\"text-decoration: underline;\"><strong>Whole-Life / Term-Life Plans</strong></span><br>These are insurance plans that covers you for your life. There is a difference between Whole-Life and Term. </p>\n<p>After starting your career as a young-adult, this, in my opinion, should be the second plan to get for your portfolio (better if you can purchase it together with your Hospitalization plan), as the older you get, the more expensive the premium becomes, because you are more susceptible to death, as the law of nature states.</p>\n<p>Whole-Life: covers you for whole of life, especially after paying all your premiums. You can purchase an X amount of \"Sum Assured\". Do note that the higher the \"Sum Assured\", the more expensive the premium is. There is an option to surrender your Whole-Life Plan, in which you receive a lump-sum payout. However, it is INADVISBLE to do so. Never use your Whole-Life plan as in investment tool, it is just not worth it.</p>\n<p>Term-Life Plans: Think of it as renting a car, the moment you do not need it, you can cancel it. However, there is no option to surrender this plan to get a lump-sum payout, which makes this sort of plans a whole lot affordable compared to Whole-Life plans.</p>\n<p><span style=\"text-decoration: underline;\"><strong>Critical Illness Plans</strong></span><br>Remember my NEWSFLASH from earlier? Again, no one is immune to diseases. For these plans, you will receive a payout should you ever (touch-wood!) contract a disease. This payout helps to cover the cost for treatment or income lost. These plans terminates itself once the payout has been given. So, if you receive the payout when you get the diesease, and you die from it, your estate will NOT get another payout from the plan.</p>\n<p>However, there are options to tag Critical Illness with your Life (Whole or Term) Plans. If tagged, these plans are slightly more affordable compared to an a-la-carte purchase.</p>\n<p>The mechanics for these plans differ from provider to provider. For more information on the diseases covered or mechanics of the plan, please refer to your Insurance provider.</p>\n<p><span style=\"text-decoration: underline;\"><strong>Accident Plans</strong></span><br>These are plans that compliments your portfolio. Honestly, in my opinion, these plans are the lowest priority in today's list. For Accident Plans, you get a payout should you lose a limb, or even a part of your limb, due to accidents. I'm not really up to date about the mechanics, but there are some whereby you can get a reimbursement from your visitation to your local medical practitioner (of course, it is subjected to terms and conditions).</p>\n<p><span style=\"text-decoration: underline;\"><strong>Disability Income Plans</strong></span><br>Another type of Insurance that compliments your portfolio, Disability Income plans replaces a portion of your income if you are unable to work due to illness or accident (loss of limbs). Payment will stop or reduce once you start working again. </p>\n<p> </p>\n<h3>Last Words</h3>\n<p>Once again, I am sharing whatever I know about today's topic. I hope it shed some light in the differnet types of Insurance an insurance company can provide. Do not use my information as advice. Please consult a proper Financial Consultant for your portfolio goals.</p>\n<p>I believe it is a personal duty to see this aspect of life covered to ensure those that you leave behind are well taken care of, as we never know what will happen in the future. Life, is unexpectedly short. Better have it and not use it, rather than needing it when you have none.</p>\n<p> </p>\n<p>Warmest,<br>- Stephano</p>",
            "author": {
                "name": "Stephano"
            },
            "tags": [
                   "moneytalk",
                   "09/2025"
            ],
            "date_published": "2025-09-02T22:12:00+08:00",
            "date_modified": "2025-09-02T22:12:00+08:00"
        },
        {
            "id": "https://LCStephano.github.io/the_memoirs/gods-deities-ghosts-and-demons.html",
            "url": "https://LCStephano.github.io/the_memoirs/gods-deities-ghosts-and-demons.html",
            "title": "Religion | Science",
            "summary": "Last post for the month. Today's post might trigger some, but these are my thoughts and they will stay with me till I go inside a casket. I do not give a rat's ass if anyone&hellip;",
            "content_html": "<p>Last post for the month. Today's post might trigger some, but these are my thoughts and they will stay with me till I go inside a casket. I do not give a rat's ass if anyone is offended, and I will not change them. I'm NOT sorry.</p>\n<p>In my last post, I wrote that I was not a religious man. Of course, from my childhood to teen years, it was mostly my Mom's influence on me on these matters, though during my teen years, this influence was starting to waiver as that was when I started to think for myself, making sense of the world.</p>\n<p class=\"msg msg--success\"><em>\"Just like to shoot straight, I'm a man of Science.\" - Rick Sanchez, Rick &amp; Morty</em></p>\n<p>Long story short, I do not believe in religion or supernatural entities; at the very least, until they can be studied, measured, and logged into a record of sorts. It is simple really - in science, for every electrically neutral atom, for every proton, there must be an electron. Newton's Third Law of Motion: for every action, there must be an opposite and equal reaction. If there is a good, there must be a bad. If I do not believe in one, logically, I would not believe in the other.</p>\n<p>The very concept of Gods and Demons had always been a man-made thing, starting from say 50,000 to 60,000 years ago, when humans evolved some form of complexity or sophistication in our cognitive process. For example, when a volcano erupts, or it is heavily storming with thunderous roars, our forefathers would have thought the gods are angry, probably requiring a sacrifice.</p>\n<p>Over the years, over time, religion has evolved into what it is today. There could have been some evidence(s) that certain individuals tied to the religions today existed, but then yet again, how credible are said evidences?</p>\n<p>On the other hand, Science, consistently proves itself, remains constant, in accordance to our laws of physics, and discovers new things. In science, there is nothing to <em>believe</em>, it is whether you <em>accept</em>.</p>\n<p>Today you can ask me, \"what was there before nothing?\"<br>I would reply, \"I don't know.\"<br>\"Then God must have created it then...\"<br>So what created \"God\"?</p>\n<p>I think when it comes to the universe, I would believe that everything was once a single super-dense object, smaller than a grain of rice, in which it exploded, expanded to what we are today. Scientists say the universe is ever expanding, some say there is a \"Great Attractor\" and we are heading towards it. I feel, the whole universe could be a vicious cycle. Condense into a singularity, expand, contract and condense to a singularity again.</p>\n<p>Yet again, this is the beauty of science, because science has yet to tread these ever-lasting mysteries. If it ever did (and it will eventually), religion is ever a receding pocket of scientific ignorance. I think Ricky Gervais says it best, and I quote \"destroy all the religious books now, in 1000 years, they will come back different. Destroy all the science books now, in 1000 years, they will still come back the same\".</p>\n<p>It might seem I'm bashing on religion, but these are just my reasoning as to why I'm an advocate of science. Honestly, no offense. And I can get why people need religion, as they need something to hold on to, to have faith. No right or wrong, to each his own. For me, I will face whatever as it is.</p>\n<p> </p>\n<h3>A Curveball</h3>\n<p>Side track a little, since we are on religion and science. I have a friend that has the \"third eye\", meaning she can see, experience and interact with supernatural beings, good or bad. We call her the \"Ghost Hunter\".</p>\n<p>Again, I do not believe in these stuffs, but when it comes to her, I will not label her as a \"schizophrenic\" because it does not make sense to do so, and it is low-key offensive to just dismiss her experiences. She is a very good friend for years, and she has no reason to lie. When it comes to this, at best, I am a skeptic. I believe in her beliefs of these experiences. Again, I will fully believe when these entities can be measured in one way or another.</p>\n<p>Maybe, let's just say these entities exists: what if she is one of those who can tap into a higher dimension to interact with these entities? What if these entities exist in a dimension that is beyond our own (3 dimensions that of space, 1 of time). What if this is the next step in human evolution, to transcend time to whenever we want (something like in the movie <em>Interstellar</em>)?</p>\n<p>Just a little something to ponder.</p>\n<p> </p>\n<p>Warmest,<br>- Stephano</p>",
            "author": {
                "name": "Stephano"
            },
            "tags": [
                   "reflections",
                   "random thoughts",
                   "08/2025"
            ],
            "date_published": "2025-08-24T15:48:00+08:00",
            "date_modified": "2025-08-24T20:40:06+08:00"
        },
        {
            "id": "https://LCStephano.github.io/the_memoirs/a-philosophy-of-eating-beef.html",
            "url": "https://LCStephano.github.io/the_memoirs/a-philosophy-of-eating-beef.html",
            "title": "A Philosophy of Eating Beef.",
            "summary": "I've only started to eat beef when I was 21. \"Why?\" you might ask. Well, partially it was religious reasons as my Mom was a buddhist. Partially, it's also I'm an actual adult, and the full&hellip;",
            "content_html": "<p>I've only started to eat beef when I was 21. \"Why?\" you might ask. Well, partially it was religious reasons as my Mom was a buddhist. Partially, it's also I'm an actual adult, and the full \"rebelliousness\" was in full effect, whereby I can think for myself without the control from a parent, piece one and one together, and make proper choices. Spoiler alert: I'm not a religious person at all (also for a future post).</p>\n<p>That being said, I still remember the first time I had beef. AlaskanTF, some ex-secondary school classmates, and I went to this K-BBQ place. They were like \"TRY!\" looking at me with a piece of beef on their chopsticks, and they placed it on my plate. I took it, placed it in my mouth, chewed and swallowed.</p>\n<blockquote><em>FUCK ME! What have I been missing all these years?</em></blockquote>\n<p>I instantly fell in love with beef. The reaction of AlaskanTF and friends says it all. Ever since that day, whenever I ate out, I always selected beef as the choice of proteins, also to catch up on all the lost years of not eating beef. That soon advanced into Steakhouses. The first was <em>Jack's Place</em>, a local steakhouse. Over the few times I've been to <em>Jack's Place</em>, I tried some of the different cuts, compared to the thinly-sliced beef cuts they have in those BBQ places, it was a whole other experience. I thought <em>Jack's Place</em> was the best, <em>or so i thought</em>.</p>\n<p>Cue my first overseas military exercise. On one of our off days, my superiors brought me out to <em>Texas Roadhouse</em>. I cannot remember what I had, but all I remember was the steak was the best that I had in my life, and it was my birthday as well! Up till that point, my philosophy was beef was best enjoyed as a steak. Coming back home, nowhere that sold beef here brought me the same joy as I had experienced at <em>Texas Roadhouse</em>.</p>\n<p>As time went on, I stumbled upon the Omakase-style steakhouse. Just when I thought it cannot get better, it just did. These sort of steakhouses, present a Omakase Set Course menu for you, giving you different cuts of meat (though not as thick a cut compared to steaks). There <em>IS</em> actually more to just a Striploin, or a Ribeye. Don't get me wrong, while latter cuts are still enjoyable, the Omakase-style is more brilliant, as it gives you the more exotic or adventurous cuts such as Tounge, Tripe, Cheek, and so forth.</p>\n<p>This is my philosophy now. Beef is best enjoyed in different cuts. I would now eagerly introduce my friends to two steakhouses locally which gives customers the Omakase Set Course menus, should we want to eat proper beef. I've grown to love Beef Tounge and Tripe. Depending on which part of the tounge it is, the tip gives you a more \"bouncy\" sort of profile, while the root of the tounge gives you more bite. Tripe might feel a little gamey, but if done right, it is actually quite delicious.</p>\n<p>Other underrated cuts: Hanger and Skirt. These two are the more juicy cuts, with the skirt offering more of a bite.</p>\n<p>Another thing I would like to mention is I have had Japanese A4 and A5 Wagyu, USDA Prime, and Australian Wagyu. Personally, Japanese A4 Wagyu is the best, as you can grill them, and eat multiple cuts, without going to the point you are sick of eating, because of all the fats and marbeling. Others are great, but Japanese A4 Wagyu is S-Tier for me.</p>\n<p>That's about it.</p>\n<p> </p>\n<p>Warmest,<br>- Stephano</p>",
            "author": {
                "name": "Stephano"
            },
            "tags": [
                   "reflections",
                   "food and bev",
                   "08/2025"
            ],
            "date_published": "2025-08-19T13:17:00+08:00",
            "date_modified": "2025-08-24T03:05:57+08:00"
        },
        {
            "id": "https://LCStephano.github.io/the_memoirs/chicken-rice.html",
            "url": "https://LCStephano.github.io/the_memoirs/chicken-rice.html",
            "title": "Chicken Rice.",
            "summary": "Hainanese Chicken Rice - IT'S THE BEST! Where I am from, Chicken Rice could very well be a staple dish for most individuals - simple, economical, comforting and delicious. To the uninitiated, Chicken Rice very well&hellip;",
            "content_html": "<p>Hainanese Chicken Rice - IT'S THE BEST!</p>\n<p>Where I am from, Chicken Rice could very well be a staple dish for most individuals - simple, economical, comforting and delicious.</p>\n<p>To the uninitiated, Chicken Rice very well consists of chicken, and rice! 😁<br>But not just any rice, as the rice has to be cooked with the broth created from the chicken, with some ginger, pandan leave, and some other seasoning (one can search for the recipe online). To top it off, the chicken served could be either roasted or steamed. </p>\n<p>Personally, I do not eat Chicken Rice for the chicken, I eat it for the rice, as I feel the rice is what sets apart from one stall / shop to another. Honestly, if the rice is that delicious, like from the stalls listed below, I feel I can eat an entire barrel of just the rice. In most cases, the chicken tastes similar to me (please dont sue xD). I should know better, as I have been eating this for most of my life, since childhood. And, it is for that reason, I have narrowed down to three of the best Chicken Rice stalls (in my opinion) in this country.</p>\n<p>In no particular order:<br><br>1) Loy Kee Best Chicken Rice - Balestier Road<br>I'm not sure whether they changed, but the last I had, their choice of rice (looking at the length of the grains, Basmati, I presume?) absorbs the fragrance so much, such that the rice need not have the oil dressings (that come with the chicken) to go with. I also remember, they used to have Nasi Lemak as well, in which i swapped the Coconut Milk rice for Chicken Rice rice. Their chicken, is a little tough for me, and if their rice is combined with the chicken from the stalls next in this list, it is chicken rice heaven!</p>\n<p>2) Feng Feng Hainanese Chicken Rice - Marsiling<br>On a good day, their rice has a balanced level of the chicken-oiliness, which creates the savoury flavour; best paired with the oil seasonings they drizzle over the chicken. Chicken is tender. Whether you are lucky or not, they also do serve achar (pickled cucumber / pineapple) to go with the meal. All in all, an excellent, economical meal.</p>\n<p>3) Yishun 925 - Yishun<br>I know there are outlets other than the one in Yishun, such as one in Jurong East. They have a similar taste profile to Feng Feng, but their rice is quite consistent with the quality, oiliness level, and fluffliness, in every visit that I pay. Chicken is also soft and tender, which is bathed in the sesame oil dressing.</p>\n<p>Well, there you have it. Whether you live here or whoever is visiting Singapore, and is willing to travel for good Chicken Rice, consider visiting these places that I have listed. Again, this is just my humble opinion on the best Chicken Rice spots. If you know one, you could let me know (once I figured out how to input some communication channels).<br><br></p>\n<p>Warmest,<br>- Stephano</p>",
            "author": {
                "name": "Stephano"
            },
            "tags": [
                   "food and bev",
                   "08/2025"
            ],
            "date_published": "2025-08-15T14:32:00+08:00",
            "date_modified": "2025-08-24T03:06:08+08:00"
        },
        {
            "id": "https://LCStephano.github.io/the_memoirs/my-favourite-slasher.html",
            "url": "https://LCStephano.github.io/the_memoirs/my-favourite-slasher.html",
            "title": "My favourite Slasher.",
            "summary": "Let us start off with something borderline unhinged. We have all seen our fair share of slasher / thriller films, such as \"Saw\", \"Scream\", \"Nightmare on Elm Street\", \"Halloween\", so on and so forth. Out of&hellip;",
            "content_html": "<p>Let us start off with something borderline unhinged.</p>\n<p>We have all seen our fair share of slasher / thriller films, such as \"Saw\", \"Scream\", \"Nightmare on Elm Street\", \"Halloween\", so on and so forth. Out of all of them, I would have to say Michael Myers (Halloween) is my favourite. But, really, the love for Michael Myers cemented when I was playing <em>Dead by Daylight</em> back in the day.</p>\n<p>Stealth, stalk, slit - that is his killing philosophy. Simple, easy and contemporary, it gets the job done. The other killers play with their victims too much, in my opinion. In some ways, it kind of disrupts the aura and mystique around those characters.</p>\n<p>Chucky: screws around too much, even though he is hard to catch and skittish (which I understand, is part of his character). This little rat somewhat gave me a somewhat traumatic lasting impression during childhood, though it is non-existent now.</p>\n<p>Freddy Krueger: can't really remember much as it was plenty of years ago I watched. But I know, if one dies in the dream, he dies in real life too.</p>\n<p>Jigsaw: I do not think I can survive in any of Jigsaw's games 😅</p>\n<p>Jason Voorhees: never really watched Friday the 13th series. I cannot comment.</p>\n<p>Ghostface: while his stealth is on-point, I can understand his thing for psychological warfare by calling his victims before killing them. Still, not my thing.</p>\n<p>Which is why Michael Myers is my favourite. I would like to think I have a fighting chance against him, even though the odds are against me. I can run, but I would also expect him to walk faster than I run, or appear somewhere bamboozling me xD</p>\n<p>I have watched the original 1978 film, Halloween II, and the recent reboot from 2018 to 2022. I did not really bother watching those in between, as I feel like, from the little snippets that I have watched on Youtube, it did not really bring justice to his character. Michael Myers is literally the Evil Incarnate, with an ungodly tolerance to pain. The original first two, and the recent reboot did really bring out something: the <em>fear</em>, the thriller \"<em>oomph!</em>\" that really brings you into the movie, and, to some extend, feeling what Michael's victims are experiencing.</p>\n<p>Watching the recent and modern reboot has me rooting for both Laurie Strode and Michael Myers. Watching \"Halloween Ends\" was kind of a bittersweet moment. As much as I did not want this awesome franchise to end, I would still have to let go, as everything has to come an end. However, the legend behind the story of Michael Myers (and Laurie Strode, of course), will forever live. Also, the seemingly infinite amount of jumpscares when playing against Michael Myers in <em>Dead by Daylight</em>.</p>\n<p>Could I also do a shoutout to the music composer behind those Halloween films I've watched - John Carpenter. As I understand, his son worked with him on the 2018 to 2022 films. How one simple melody, played with the right tempo and instrument, can be so menacing and thrilling. Just when you think they cannot outdo the original, they somehow managed to pull it off. Case in point: <a href=\"https://www.youtube.com/watch?v=m8H3M0DDWDs\" target=\"_blank\" rel=\"noopener noreferrer\">The Shape Hunts Allyson - John Carpenter</a>, from Halloween 2018.</p>\n<p>Well, there you have it: awesome character(s), with a great aura and mystique around Michael Myers, slapping music to lift up the characters of the movie, and a beautiful thrilling energy to not make you want to look, but still take a peek to find out what happens next to the victims. This is Halloween.<br><br></p>\n<p>Warmest,<br>- Stephano</p>",
            "author": {
                "name": "Stephano"
            },
            "tags": [
                   "random thoughts",
                   "08/2025"
            ],
            "date_published": "2025-08-11T02:11:53+08:00",
            "date_modified": "2025-08-24T03:06:15+08:00"
        },
        {
            "id": "https://LCStephano.github.io/the_memoirs/pilot.html",
            "url": "https://LCStephano.github.io/the_memoirs/pilot.html",
            "title": "Pilot.",
            "summary": "First (and test) post! This space is still bare, with just the skeleton and certain foundations being built. Nevertheless, I'd still love to thank AlaskanTF and tabsTrainee for being patient, and helping me set up this&hellip;",
            "content_html": "<p>First (and test) post! This space is still bare, with just the skeleton and certain foundations being built. Nevertheless, I'd still love to thank <a href=\"blog.alaskantf.com\" target=\"_blank\" rel=\"noopener noreferrer\">AlaskanTF</a> and tabsTrainee for being patient, and helping me set up this little space.</p>\n<p>Hello! My name is Stephano. The 'LC' in the link just stands for LeCreuset. I'm just a random regular human, just like you, on this rock we call \"Earth\", made from star-dust floating through space, surviving and experiencing life. This space acts as a diary of sorts, in the case I ever suffer from Alzheimer's or Senile Dementia xD</p>\n<p>I also hope to bring some form of entertainment through the day-to-day shenanigans, some thought-provoking topics, and also to share some random things that could be going through my mind. I shall try to update as and when I can.</p>\n<p>Till the next post...<br><br>Warmest,<br>- Stephano</p>",
            "author": {
                "name": "Stephano"
            },
            "tags": [
                   "pilot",
                   "08/2025"
            ],
            "date_published": "2025-08-08T01:47:36+08:00",
            "date_modified": "2025-08-24T20:43:47+08:00"
        }
    ]
}
